# Pandas教程

by 褚则伟

### 2017七月在线 机器学习线上集训 julyedu.com

## 目录
- Series
- DataFrame
- Index, reindex and hierarchical indexing

## 数据结构DataFrame

### 2017七月在线 机器学习线上集训 julyedu.com

In [2]:
import pandas as pd
import numpy as np

In [3]:
cities = {'Beijing': 55000, 'Shanghai': 60000, 'Shenzhen': 50000, 'Hangzhou': 20000, 'Guangzhou': 25000, 'Suzhou': None}
# apts = pd.Series(cities)
apts = pd.Series(cities, name="price")
apts

Beijing      55000.0
Guangzhou    25000.0
Hangzhou     20000.0
Shanghai     60000.0
Shenzhen     50000.0
Suzhou           NaN
Name: price, dtype: float64

In [4]:
cars = pd.Series({'Beijing': 300000, 'Shanghai': 400000, 'Shenzhen': 300000, \
                      'Tianjin': 200000, 'Guangzhou': 200000, 'Chongqing': 150000}, name="cars")
cars

Beijing      300000
Chongqing    150000
Guangzhou    200000
Shanghai     400000
Shenzhen     300000
Tianjin      200000
Name: cars, dtype: int64

In [5]:
df = pd.DataFrame({"apts": apts, "cars": cars})
df

              apts      cars
Beijing    55000.0  300000.0
Chongqing      NaN  150000.0
Guangzhou  25000.0  200000.0
Hangzhou   20000.0       NaN
Shanghai   60000.0  400000.0
Shenzhen   50000.0  300000.0
Suzhou         NaN       NaN
Tianjin        NaN  200000.0

In [83]:
df["apts"]

Beijing      55000.0
Chongqing        NaN
Guangzhou    25000.0
Hangzhou     20000.0
Shanghai     60000.0
Shenzhen     50000.0
Suzhou           NaN
Tianjin          NaN
Name: apts, dtype: float64

加入一个新的column,默认会broadcast

In [84]:
df

              apts      cars
Beijing    55000.0  300000.0
Chongqing      NaN  150000.0
Guangzhou  25000.0  200000.0
Hangzhou   20000.0       NaN
Shanghai   60000.0  400000.0
Shenzhen   50000.0  300000.0
Suzhou         NaN       NaN
Tianjin        NaN  200000.0

In [85]:
df["income"] = 20000
df

              apts      cars  income
Beijing    55000.0  300000.0   20000
Chongqing      NaN  150000.0   20000
Guangzhou  25000.0  200000.0   20000
Hangzhou   20000.0       NaN   20000
Shanghai   60000.0  400000.0   20000
Shenzhen   50000.0  300000.0   20000
Suzhou         NaN       NaN   20000
Tianjin        NaN  200000.0   20000

In [86]:
df["total_cost"] = df["apts"]*100 + df["cars"]
df

              apts      cars  income  total_cost
Beijing    55000.0  300000.0   20000   5800000.0
Chongqing      NaN  150000.0   20000         NaN
Guangzhou  25000.0  200000.0   20000   2700000.0
Hangzhou   20000.0       NaN   20000         NaN
Shanghai   60000.0  400000.0   20000   6400000.0
Shenzhen   50000.0  300000.0   20000   5300000.0
Suzhou         NaN       NaN   20000         NaN
Tianjin        NaN  200000.0   20000         NaN

DataFrame的行由index决定

In [87]:
print(type(df.index))
print(df.index)

<class 'pandas.core.indexes.base.Index'>
Index(['Beijing', 'Chongqing', 'Guangzhou', 'Hangzhou', 'Shanghai', 'Shenzhen',
       'Suzhou', 'Tianjin'],
      dtype='object')

DataFrame的列由column names决定

In [88]:
print(df["apts"])
print(type(df["apts"]))

Beijing      55000.0
Chongqing        NaN
Guangzhou    25000.0
Hangzhou     20000.0
Shanghai     60000.0
Shenzhen     50000.0
Suzhou           NaN
Tianjin          NaN
Name: apts, dtype: float64
<class 'pandas.core.series.Series'>

In [89]:
print(df.apts)
print(type(df.apts))

Beijing      55000.0
Chongqing        NaN
Guangzhou    25000.0
Hangzhou     20000.0
Shanghai     60000.0
Shenzhen     50000.0
Suzhou           NaN
Tianjin          NaN
Name: apts, dtype: float64
<class 'pandas.core.series.Series'>

loc方法可以用index选中行

In [90]:
print(df.loc["Hangzhou"])
print(type(df.loc["Hangzhou"]))

apts          20000.0
cars              NaN
income        20000.0
total_cost        NaN
Name: Hangzhou, dtype: float64
<class 'pandas.core.series.Series'>

In [91]:
print(df.loc["Hangzhou":"Suzhou"])

             apts      cars  income  total_cost
Hangzhou  20000.0       NaN   20000         NaN
Shanghai  60000.0  400000.0   20000   6400000.0
Shenzhen  50000.0  300000.0   20000   5300000.0
Suzhou        NaN       NaN   20000         NaN

下面这种方法默认用来选列而不是选行

In [92]:
# print(df["Hangzhou"])

iloc方法可以用数字选中行

In [93]:
print(df.iloc[1])
type(df.iloc[1])

apts               NaN
cars          150000.0
income         20000.0
total_cost         NaN
Name: Chongqing, dtype: float64

pandas.core.series.Series

行列一起选

In [94]:
df[["apts", "income"]].loc["Chongqing":"Shanghai"]

              apts  income
Chongqing      NaN   20000
Guangzhou  25000.0   20000
Hangzhou   20000.0   20000
Shanghai   60000.0   20000

In [95]:
df.ix[1:4,1:3]

/Users/zeweichu/anaconda3/envs/py36/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

               cars  income
Chongqing  150000.0   20000
Guangzhou  200000.0   20000
Hangzhou        NaN   20000

### DataFrame元素赋值

In [96]:
df["income"].loc["Beijing"] = 30000
df

/Users/zeweichu/anaconda3/envs/py36/lib/python3.6/site-packages/pandas/core/indexing.py:179: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

              apts      cars  income  total_cost
Beijing    55000.0  300000.0   30000   5800000.0
Chongqing      NaN  150000.0   20000         NaN
Guangzhou  25000.0  200000.0   20000   2700000.0
Hangzhou   20000.0       NaN   20000         NaN
Shanghai   60000.0  400000.0   20000   6400000.0
Shenzhen   50000.0  300000.0   20000   5300000.0
Suzhou         NaN       NaN   20000         NaN
Tianjin        NaN  200000.0   20000         NaN

可以给一整列赋值

In [97]:
df['income'] = 15000
print(df)

              apts      cars  income  total_cost
Beijing    55000.0  300000.0   15000   5800000.0
Chongqing      NaN  150000.0   15000         NaN
Guangzhou  25000.0  200000.0   15000   2700000.0
Hangzhou   20000.0       NaN   15000         NaN
Shanghai   60000.0  400000.0   15000   6400000.0
Shenzhen   50000.0  300000.0   15000   5300000.0
Suzhou         NaN       NaN   15000         NaN
Tianjin        NaN  200000.0   15000         NaN

In [98]:
df.loc['Suzhou'] = 0
print(df)

              apts      cars  income  total_cost
Beijing    55000.0  300000.0   15000   5800000.0
Chongqing      NaN  150000.0   15000         NaN
Guangzhou  25000.0  200000.0   15000   2700000.0
Hangzhou   20000.0       NaN   15000         NaN
Shanghai   60000.0  400000.0   15000   6400000.0
Shenzhen   50000.0  300000.0   15000   5300000.0
Suzhou         0.0       0.0       0         0.0
Tianjin        NaN  200000.0   15000         NaN

In [99]:
df.income = np.arange(8)*10000
print(df)

              apts      cars  income  total_cost
Beijing    55000.0  300000.0       0   5800000.0
Chongqing      NaN  150000.0   10000         NaN
Guangzhou  25000.0  200000.0   20000   2700000.0
Hangzhou   20000.0       NaN   30000         NaN
Shanghai   60000.0  400000.0   40000   6400000.0
Shenzhen   50000.0  300000.0   50000   5300000.0
Suzhou         0.0       0.0   60000         0.0
Tianjin        NaN  200000.0   70000         NaN

还可以用Series来指定需要修改的index以及相对应的value，没有指定的默认用NaN.

In [100]:
val = pd.Series([10000, 20000, 30000], index=['Shanghai', 'Beijing', 'Shenzhen'])
df['income'] = val
print(df)

              apts      cars   income  total_cost
Beijing    55000.0  300000.0  20000.0   5800000.0
Chongqing      NaN  150000.0      NaN         NaN
Guangzhou  25000.0  200000.0      NaN   2700000.0
Hangzhou   20000.0       NaN      NaN         NaN
Shanghai   60000.0  400000.0  10000.0   6400000.0
Shenzhen   50000.0  300000.0  30000.0   5300000.0
Suzhou         0.0       0.0      NaN         0.0
Tianjin        NaN  200000.0      NaN         NaN

In [101]:
df['western'] = (df.index == 'Chongqing')
print(df)

              apts      cars   income  total_cost  western
Beijing    55000.0  300000.0  20000.0   5800000.0    False
Chongqing      NaN  150000.0      NaN         NaN     True
Guangzhou  25000.0  200000.0      NaN   2700000.0    False
Hangzhou   20000.0       NaN      NaN         NaN    False
Shanghai   60000.0  400000.0  10000.0   6400000.0    False
Shenzhen   50000.0  300000.0  30000.0   5300000.0    False
Suzhou         0.0       0.0      NaN         0.0    False
Tianjin        NaN  200000.0      NaN         NaN    False

In [102]:
print(df.columns)

Index(['apts', 'cars', 'income', 'total_cost', 'western'], dtype='object')

一个DataFrame就和一个numpy 2d array一样，可以被转置

In [103]:
df.T

,Beijing,Chongqing,Guangzhou,Hangzhou,Shanghai,Shenzhen,Suzhou,Tianjin
apts,55000,NaN,25000,20000,60000,50000,0,NaN
cars,300000,150000,200000,NaN,400000,300000,0,200000
income,20000,NaN,NaN,NaN,10000,30000,NaN,NaN
total_cost,5.8e+06,NaN,2.7e+06,NaN,6.4e+06,5.3e+06,0,NaN
western,False,True,False,False,False,False,False,False

用info查看DataFrame的信息

In [104]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, Beijing to Tianjin
Data columns (total 5 columns):
apts          6 non-null float64
cars          7 non-null float64
income        3 non-null float64
total_cost    5 non-null float64
western       8 non-null bool
dtypes: bool(1), float64(4)
memory usage: 648.0+ bytes

我们还可以指定index的名字和列的名字

In [105]:
df.index.name = 'city'
df.columns.name = 'info'
print(df)

info          apts      cars   income  total_cost  western
city
Beijing    55000.0  300000.0  20000.0   5800000.0    False
Chongqing      NaN  150000.0      NaN         NaN     True
Guangzhou  25000.0  200000.0      NaN   2700000.0    False
Hangzhou   20000.0       NaN      NaN         NaN    False
Shanghai   60000.0  400000.0  10000.0   6400000.0    False
Shenzhen   50000.0  300000.0  30000.0   5300000.0    False
Suzhou         0.0       0.0      NaN         0.0    False
Tianjin        NaN  200000.0      NaN         NaN    False

In [106]:
print(df.values)
print(frame2)
print(type(frame2.values))

[[55000.0 300000.0 20000.0 5800000.0 False]
 [nan 150000.0 nan nan True]
 [25000.0 200000.0 nan 2700000.0 False]
 [20000.0 nan nan nan False]
 [60000.0 400000.0 10000.0 6400000.0 False]
 [50000.0 300000.0 30000.0 5300000.0 False]
 [0.0 0.0 nan 0.0 False]
 [nan 200000.0 nan nan False]]
info          apts      cars   income  total_cost  western
city
Beijing    55000.0  300000.0  20000.0   5800000.0    False
Chongqing      NaN  150000.0      NaN         NaN     True
Guangzhou  25000.0  200000.0      NaN   2700000.0    False
Hangzhou   20000.0       NaN      NaN         NaN    False
Shanghai   60000.0  400000.0  10000.0   6400000.0    False
Shenzhen   50000.0  300000.0  30000.0   5300000.0    False
Suzhou         0.0       0.0      NaN         0.0    False
Tianjin        NaN  200000.0      NaN         NaN    False
<class 'numpy.ndarray'>

### 更多关于DataFrame slicing

In [16]:
df.loc["Chongqing":"Hangzhou", ["apts"]]

              apts
Chongqing      NaN
Guangzhou  25000.0
Hangzhou   20000.0

In [19]:
df[2:5]

              apts      cars
Guangzhou  25000.0  200000.0
Hangzhou   20000.0       NaN
Shanghai   60000.0  400000.0

In [20]:
df.isin([2500, 20000, 60000])

            apts   cars
Beijing    False  False
Chongqing  False  False
Guangzhou  False  False
Hangzhou    True  False
Shanghai    True  False
Shenzhen   False  False
Suzhou     False  False
Tianjin    False  False

In [22]:
df["apts"].where(df["apts"] > 50000)

Beijing      55000.0
Chongqing        NaN
Guangzhou        NaN
Hangzhou         NaN
Shanghai     60000.0
Shenzhen         NaN
Suzhou           NaN
Tianjin          NaN
Name: apts, dtype: float64

In [24]:
df.fillna(value=0)

              apts      cars
Beijing    55000.0  300000.0
Chongqing      0.0  150000.0
Guangzhou  25000.0  200000.0
Hangzhou   20000.0       0.0
Shanghai   60000.0  400000.0
Shenzhen   50000.0  300000.0
Suzhou         0.0       0.0
Tianjin        0.0  200000.0

In [25]:
df.fillna(method="bfill")

              apts      cars
Beijing    55000.0  300000.0
Chongqing  25000.0  150000.0
Guangzhou  25000.0  200000.0
Hangzhou   20000.0  400000.0
Shanghai   60000.0  400000.0
Shenzhen   50000.0  300000.0
Suzhou         NaN  200000.0
Tianjin        NaN  200000.0

In [26]:
df.fillna(method="ffill")

              apts      cars
Beijing    55000.0  300000.0
Chongqing  55000.0  150000.0
Guangzhou  25000.0  200000.0
Hangzhou   20000.0  200000.0
Shanghai   60000.0  400000.0
Shenzhen   50000.0  300000.0
Suzhou     50000.0  300000.0
Tianjin    50000.0  200000.0

In [27]:
df.bfill()

              apts      cars
Beijing    55000.0  300000.0
Chongqing  25000.0  150000.0
Guangzhou  25000.0  200000.0
Hangzhou   20000.0  400000.0
Shanghai   60000.0  400000.0
Shenzhen   50000.0  300000.0
Suzhou         NaN  200000.0
Tianjin        NaN  200000.0

In [28]:
df.ffill()

              apts      cars
Beijing    55000.0  300000.0
Chongqing  55000.0  150000.0
Guangzhou  25000.0  200000.0
Hangzhou   20000.0  200000.0
Shanghai   60000.0  400000.0
Shenzhen   50000.0  300000.0
Suzhou     50000.0  300000.0
Tianjin    50000.0  200000.0

In [6]:
df

              apts      cars
Beijing    55000.0  300000.0
Chongqing      NaN  150000.0
Guangzhou  25000.0  200000.0
Hangzhou   20000.0       NaN
Shanghai   60000.0  400000.0
Shenzhen   50000.0  300000.0
Suzhou         NaN       NaN
Tianjin        NaN  200000.0

In [9]:
row = df.loc["Guangzhou"]

In [10]:
df - row

              apts      cars
Beijing    30000.0  100000.0
Chongqing      NaN  -50000.0
Guangzhou      0.0       0.0
Hangzhou   -5000.0       NaN
Shanghai   35000.0  200000.0
Shenzhen   25000.0  100000.0
Suzhou         NaN       NaN
Tianjin        NaN       0.0

In [16]:
col = df["cars"]
df.sub(col, axis=0)

               apts  cars
Beijing   -245000.0   0.0
Chongqing       NaN   0.0
Guangzhou -175000.0   0.0
Hangzhou        NaN   NaN
Shanghai  -340000.0   0.0
Shenzhen  -250000.0   0.0
Suzhou          NaN   NaN
Tianjin         NaN   0.0